Repository: 84000/data-translation-memory
Catalog: toh55_84000-the-teaching-on-the-effulgence-of-light.tmx
Source language: bo
Languages: en

source: །རྣམ་སྨིན་ཐུག་པ་མེད་པར་ལྟོས།
en: Was therefore uninterrupted.

source: །ཁྱེད་ཀྱིས་རྐང་གཉིས་གཙོ་མཆོག་ནི།
en: You see how the perfect leader of human beings

source: །ཟག་མེད་ཚུལ་ཁྲིམས་རྫོགས་པས་ན།
en: Had perfected undefiled discipline,

source: །སེམས་ཅན་དག་ནི་མང་པོ་རྣམས།
en: Causing many sentient beings

source: །གུས་པས་སྤྱི་བོས་ཕྱག་བྱེད་དང་། །ལྷ་ཡི་འཁོར་ནི་མང་པོ་རྣམས།
en: To respectfully prostrate to him, And how numerous divine retinues

source: །སོ་སོའི་གཞལ་མེད་ཁང་སྤངས་ནས།
en: Abandoned their palaces And attended to the Guide,

source: །རྩེ་བ་དག་ལ་ཆགས་མེད་པར། །འདྲེན་པ་ལ་ནི་རྟེན་བྱེད་ལྟོས།
en: Without any attachment to playful activities.

source: །ཁྱེད་ཀྱིས་བདུད་དང་བདུད་ཀྱི་འཁོར།
en: You see how Māra and his hordes

source: །བཅོམ་ལྡན་འདས་ལ་དད་སྐྱེས་ནས།
en: Developed faith in the Blessed One,

source: །གསེར་གྱི་རླུང་ཡབ་དག་ཐོགས་ཏེ།
en: Brought forth golden fans, And arranged them around him.

source: །གཡས་གཡོན་དུ་ནི་འཁོད་པ་དང་། །བདུད་ཀྱི་བུ་ནི་ལྔ་བརྒྱ་ཡིས།
en: Five hundred māras

source: །ལྷ་ཡི་མེ་ཏོག་ཡིད་འོང་བས།
en: Tossed magnificent divine flowers

source: །དེ་བཞིན་གཤེགས་ལ་མངོན་གཏོར་ནས།
en: Onto the Thus-Gone One

source: །བླ་མེད་ཡེ་ཤེས་ཚོལ་ལ་ལྟོས།
en: And pursued unsurpassed wisdom.

source: །འདས་པའི་སངས་རྒྱས་རྣམས་ལ་ནི། །བསྔགས་པ་བརྗོད་ཅིང་མཆོད་པས་ན། །དེང་ནི་བཅོམ་ལྡན་ཕྲད་གྱུར་ནས།
en: Since they had praised and worshiped Buddhas in the past,

source: །སོ་སོར་དགའ་བར་གྱུར་པ་ཡིན། །སྤོབས་པ་དག་ནི་ཚད་མེད་ཀྱིས།
en: Each of them now became delighted Upon meeting the Blessed One;

source: །དེ་བཞིན་གཤེགས་པའི་བསྔགས་པ་བརྗོད།
en: They proclaimed the praises of the Thus-Gone One With countless eloquent words.

source: །དེ་ཡི་ཚེ་ན་བདུད་ཀྱི་བུ།
en: At that time, those māras

source: །སྲིད་པ་སྤངས་པ་ཞེས་བྱ་བ།
en: Were said to have abandoned cyclic existence.

source: །ཐོག་མར་བཅོམ་ལྡན་བསྔགས་བརྗོད་ནས།
en: As soon as they proclaimed the praises of the Blessed One,

source: །མིག་ཟད་མཐའ་ནི་ཤེས་པར་གྱུར།
en: They understood the limit of the exhaustion of the eye

source: །མིག་གི་སྐྱེ་མཐའ་ཤེས་པ་ནས།
en: And the limit of the arising of the eye,

source: །རབ་ཞི་མཚན་ཉིད་བར་དུ་རྟོགས།
en: Up to the characteristics of its utter peace. Since they had realized the boundless meanings of the eye—

source: །གཞན་ཡང་མིག་ཟད་ལ་སོགས་པའི།
en: The eye’s exhaustion and so forth—

source: །མིག་དོན་དག་ནི་དཔག་མེད་རྟོགས།
en: They taught them to sentient beings

source: །དེས་ན་ཚིག་མཁས་དག་གིས་ནི། །སེམས་ཅན་རྣམས་ལ་ཡང་དག་བསྟན།
en: With skillful words.

source: །མིང་དང་དོན་རྣམས་ལ་ཡང་ནི།
en: Since they did not cling to names and meanings

source: །ཞེན་དང་ཐེ་ཚོམ་མེད་པས་ན།
en: And had no doubts about them,

source: །འགྲོ་འོང་མེད་པར་རབ་རྟོགས་ཤིང་།
en: They realized that they do not come from or go anywhere,

source: །བླང་དོར་མེད་པ་ཉིད་དུ་གྱུར།
en: And that they are beyond adoption and rejection.

source: །རང་བཞིན་དག་ནི་སྟོང་དབེན་པས།
en: Since the nature of words is empty and void,

source: །ཡི་གེ་རྣམས་ནི་སྤངས་པ་དང་། །ལེན་དང་འཛིན་དང་ཀློག་པ་དང་། །ཁ་ཏོན་འདོན་ཅིང་སྒྲུབ་མེད་རྟོགས།
en: They realized that words are beyond Abandonment, adoption, retention, Reading, recitation, and accomplishment. This has also been revealed

source: །འདས་པའི་དེ་བཞིན་གཤེགས་རྣམས་ཀྱིས། །སྔོན་ཡང་རབ་ཏུ་ཕྱེ་སྟེ་བསྟན།
en: By the thus-gone ones of the past;

source: །བཏགས་པའི་མིང་ཙམ་ཡིན་པས་ན།
en: Since they are mere imputations,

source: །ཡང་དག་བརྗོད་དུ་ཅི་ཡང་མེད།
en: They are ultimately inexpressible.

source: །རང་བཞིན་སྟོང་པ་དེ་དག་ནི།
en: Such intrinsically empty phenomena

source: །ཕུང་པོ་ཁམས་དང་སྐྱེ་མཆེད་འདས།
en: Transcend the aggregates, the elements, and the sense sources;

source: །བརྫུན་པ་མེད་ཅིང་བདེན་པའང་མེད། །གནས་དང་གནས་པ་ཡོད་པ་མིན།
en: They are neither false nor true, but groundless and unsupported;

source: །ཚིག་གིས་སྨྲ་བའི་ལམ་ཆད་ཅིང་། །སེམས་ཀྱི་སྤྱོད་པའང་རབ་ཏུ་ཞི།
en: They eliminate verbal expressions and bring thoughts to utter peace.

source: །སྐྱེ་བོའི་མཚན་མ་ཞེན་པའི་ཕྱིར།
en: Since immature beings are attached to the marks of beings,

source: །བཅོམ་ལྡན་གྲོང་ཁྱེར་གཤེགས་པར་མཐོང་།
en: They see the Blessed One coming to the city;

source: །བཅོམ་ལྡན་མཚན་མ་ཡོངས་སྤངས་ཀྱང་།
en: Although the Blessed One is completely beyond marks,

source: །བྱིས་པ་ཡང་དག་མ་ཡིན་རྟོག །བཅོམ་ལྡན་གྲོང་ཁྱེར་གཤེགས་པའི་ཚེ།
en: Those immature beings entertain mistaken thoughts.

source: །གང་ཞིག་དགའ་བ་སྐྱེ་འགྱུར་བ།
en: Those who become delighted When the Blessed One comes to the city

source: །དེ་ནི་མཚན་མར་རྟོག་པ་སྟེ།
en: Conceive of marks

source: །མྱ་ངན་གདུང་བ་དང་བཅས་པར་འགྱུར།
en: And will be tormented.

source: །གང་གིས་མཚན་མའི་རྟོག་སྤངས་པ།
en: Those who have transcended conceptual marks

source: །གྲོང་ཁྱེར་གཤེགས་པ་མཐོང་མི་འགྱུར། །གཤེགས་ཤིང་བསྐྱོད་པའི་མཚན་མ་ལ།
en: Will not see him coming to the city;

source: །རྣམ་རྟོག་མེད་པའི་ཤེས་རབ་འཐོབ།
en: They will reach the insight that is free From all concepts related to the marks of going and moving.

source: །གང་གིས་མཚན་མར་སངས་རྒྱས་མཐོང་།
en: Those who perceive the Buddha in terms of marks

source: །དེས་ནི་གྲོང་ཁྱེར་གཤེགས་པ་མཐོང་། །སྐྱེ་ཞིང་འཁོར་བའི་ཆོས་དག་ལ།
en: See him coming to the city;

source: །རྣམ་པར་རྟོག་པ་སྐྱེད་པར་བྱེད།
en: They generate concepts Related to birth and saṃsāric phenomena.

source: །གང་གིས་སངས་རྒྱས་མཚན་མར་མཐོང་།
en: Those who perceive the Buddha in terms of marks

source: །དགའ་བ་དག་ནི་སྐྱེ་འགྱུར་བ།
en: And become delighted

source: །དེ་ནི་བདུད་ཀྱི་སྤྱོད་ལ་གནས།
en: Are dwelling within Māra’s domain;

source: །བདུད་ཀྱི་སྤྱོད་ཡུལ་སྣང་བ་ཡིན།
en: Those are the manifestations of Māra’s domain.

source: །དེ་ནི་འགྱུར་བ་མཐོང་བ་ཡིན།
en: See him as changing;

source: །དེ་ནི་མྱ་ངན་གདུངས་བཅས་པས།
en: Since they are tormented,

source: །མཁས་པས་སྙིང་བརྩེར་བྱ་བ་ཡིན།
en: They are the objects of a wise person’s pity.

source: །ཆོས་ལ་ཐོབ་པར་གང་ལྟ་བ།
en: Those who view the Dharma as something to be attained

source: །དེ་ལ་ཆོས་སྟོར་མྱ་ངན་ཡོད།
en: Must also worry that the Dharma will be lost.

source: །སངས་རྒྱས་མཐོང་བ་སྐྱེས་པ་ལ།
en: Those who perceive the Buddha as taking birth

source: །མྱ་ངན་འདས་པའི་སྡུག་བསྔལ་ཡོད། །བསྐལ་པ་མང་པོ་གང་བསྒོམས་པས།
en: Experience the suffering of nirvāṇa.

source: །མཚན་མ་ཐམས་ཅད་རྟོགས་པས་ན།
en: Those who have understood all marks By training for many eons

source: །གྲོང་ཁྱེར་གཤེགས་པར་མི་རྟོག་ཅིང་།
en: Do not conceive of the Buddha coming to the city,

source: །མྱ་ངན་འདའ་བའི་འདུ་ཤེས་མེད།
en: And they do not entertain the notion of nirvāṇa.

source: །སེམས་ཀྱི་མཚན་ཉིད་སྟོང་རྟོགས་པ།
en: Those who realize that the characteristics of the mind are empty

source: །སངས་རྒྱས་སྤྱོད་ལ་གནས་པས་ན།
en: Are dwelling within the domain of the buddhas;

source: །མྱ་ངན་འདས་པའི་འདུ་ཤེས་མེད།
en: And they do not entertain the notion of nirvāṇa.

source: །གང་གིས་དེ་ལྟར་རབ་ཤེས་པ།
en: Those who clearly understand in that way

source: །སངས་རྒྱས་རྣམས་ནི་མཐོང་འགྱུར་ཞིང་།
en: Will behold the buddhas

source: །ངོ་བོ་ཉིད་ཀྱང་སྟོང་རྟོགས་པས།
en: But realize that their essence is empty;

source: །མཐར་ནི་སྐྱེ་འགག་ཅི་ཡང་མེད།
en: In the end, they completely transcend birth and cessation.

source: །བཅོམ་ལྡན་བསྐལ་པ་དཔག་མེད་ནས། །དཀའ་བ་རྣམས་ནི་རབ་སྤྱད་ནས།
en: After practicing austerities for countless eons, the Blessed One

source: །ངོ་བོ་ཉིད་ནི་སྟོང་མཁྱེན་ན། །བྱིས་པ་རྣམས་ཀྱིས་མི་རྟོགས་སོ།
en: Has realized the empty essence, but immature beings do not understand this.

source: །འཁོར་ནི་བརྒྱ་སྟོང་མང་གིས་བསྐོར།
en: He was surrounded by many hundreds of thousands of retinues.

source: །མི་དང་མི་མ་ཡིན་ལ་སོགས།
en: Compared to the merit created by humans and nonhumans

source: །དང་བའི་སེམས་ཀྱི་མཆོད་པ་བས།
en: Who make offerings with minds filled with faith,

source: །གང་གིས་སྐད་ཅིག་ཙམ་དུ་ནི།
en: The merit created by someone who, for a single instant,

source: །མིག་ཟད་མཐའ་ནི་རབ་སེམས་ཤིང་།
en: Contemplates the limit of the exhaustion of the eye

source: །མཚན་མ་རྣམས་ནི་སྟོང་རྟོགས་ན།
en: And realizes the emptiness of its marks

source: །འདི་ཡི་བསོད་ནམས་དེ་བས་འཕགས།
en: Is more exalted;

source: །བགྲང་བ་དང་ནི་གྲངས་ཀྱི་ཆ།
en: No number, fraction, or illustration Comes close to that merit.

source: །རྒྱུ་ཙམ་དུ་ཡང་མི་བཟོད་དོ།
en: Know that the same applies

source: །དེ་བཞིན་མིག་གི་སྐྱེ་མཐའ་དང་། །མིག་གི་མཐའ་དང་འཇུག་པ་ནས།
en: To the limit of the arising of the eye, Its limit, and its cognition,

source: །དེ་བཞིན་དུ་ནི་རིག་པར་བྱ།
en: The same should also be applied to the ear, the nose,

source: །དེ་ནས་དེ་ཚེ་བཅོམ་ལྡན་འདས།
en: At that time, when the Blessed One

source: །གྲོང་ཁྱེར་དུ་ནི་གཤེགས་པའི་ཚེ།
en: Came to the city,

source: །ཞབས་ནི་ས་ལ་རེག་ཙམ་གྱིས། །ས་ནི་ཀུན་ཏུ་རབ་ཏུ་གཡོས།
en: The earth started to shake By the mere fact of his feet touching the ground.

source: །རི་རྣམས་གང་ཡིན་དེ་དག་ཀྱང་།
en: All the mountains

source: །ཐམས་ཅད་བཅོམ་ལྡན་འདས་ལ་ཕྱོགས།
en: Bowed toward the Blessed One,

source: །ལྷ་དང་མི་ནི་ཆོས་ཀྱི་ཕྱིར།
en: And all the gods and humans came to listen to the Dharma

source: །ཐམས་ཅད་འོངས་ནས་གུས་མཆོད་བྱས།
en: And worshiped him with reverence.

source: །དེ་ནས་དེ་ཚེ་བཅོམ་ལྡན་འདས། །གྲོང་ཁྱེར་དུ་ནི་གཤེགས་པའི་ཚེ།
en: At that time, when the Blessed One came to the city,

source: །ལྷ་ཡི་དབང་པོ་མི་ཡི་རྒྱལ།
en: The lords of the gods, the kings of the humans,

source: །ལྷ་མ་ཡིན་ནི་མང་པོ་དང་། །གནོད་སྦྱིན་དག་ནི་མང་པོ་རྣམས། །རང་གི་གྲོང་ཁྱེར་སྤངས་ནས་ནི།
en: Many asuras, and many yakṣas left their cities,

source: །བཅོམ་ལྡན་སྤྱན་སྔར་འདུས་གྱུར་ཏེ། །རབ་ཏུ་དགའ་བས་མཆོད་པ་བྱས།
en: Gathered in front of the Blessed One, and joyfully worshiped him.

source: །དེ་ནས་དེ་ཚེ་བཅོམ་ལྡན་འདས། །གྲོང་ཁྱེར་དུ་ནི་གཤེགས་པའི་ཚེ། །གཞན་ཡང་རྣམ་པ་ཐ་དད་པའི།
en: At that time, when the Blessed One came to the city,

source: །བྱ་ཡི་ཚོགས་ནི་ཚད་མེད་པ།
en: All the countless types of birds—

source: །ནེ་ཙོ་དང་ནི་རྨ་བྱ་དང་། །ཀ་ལ་པིང་ཀ་བྱ་ཡི་རྣམས།
en: Parrots, peacocks, and kalaviṅka birds—

source: །བཅོམ་ལྡན་དེ་བཞིན་གཤེགས་པ་ཡི།
en: Started to play joyfully in the sky.

source: །ཡོན་ཏན་མཆོག་ནི་མཐོང་བས་ན།
en: When they saw the supreme qualities Of the Blessed One, the Thus-Gone One,

source: །ཐམས་ཅད་ནམ་མཁའ་དག་ལ་ནི། །རབ་ཏུ་དགའ་བས་རྣམ་པར་རྩེ།
en: They all started to sing

source: །ཐམས་ཅད་རྣམ་པ་སྣ་ཚོགས་ཀྱི། །སྒྲ་སྙན་དག་ནི་རབ་ཏུ་ཕྱུང་།
en: Various melodious tunes.

source: །བཅོམ་ལྡན་འདས་ཀྱི་ཡོན་ཏན་དང་། །རྫུ་འཕྲུལ་གྱི་ནི་སྟོབས་དག་གིས།
en: Through his miraculous powers

source: །སེམས་ཅན་ཚད་མེད་བརྒྱ་སྟོང་སྙེད།
en: All those—among the countless hundreds of thousands of beings present—

source: །ལྡོངས་པ་དག་ནི་མཐོང་བར་གྱུར།
en: Who were blind regained sight,

source: །འོན་པ་རྣམས་ནི་ཐོས་པར་གྱུར།
en: All those who were deaf could hear,

source: །དབང་པོ་མ་ཚང་གང་ཡིན་པ།
en: All those with impaired faculties

source: །ཐམས་ཅད་དབང་པོ་ཚང་བར་གྱུར།
en: Recovered the full functioning of their faculties,

source: །སྡུག་བསྔལ་ལ་ནི་གནས་པ་དག །ཐམས་ཅད་བདེ་བ་ཐོབ་པར་གྱུར།
en: And all those who were suffering became happy.

source: །གྲོང་ཁྱེར་དུ་ནི་གཤེགས་པའི་ཚེ། །ནམ་མཁའ་བར་སྣང་དག་ལས་ནི།
en: Came to the city,

source: །འདི་སྐད་སྨྲ་བ་ཐོས་པར་གྱུར།
en: These words resounded

source: །གང་གིས་མཚན་མ་རྣམས་ཀྱིས་ནི།
en: In the sky:

source: །དེ་བཞིན་གཤེགས་པ་རྟོགས་བྱེད་པ།
en: “Those who conceive of the Thus-Gone One

source: །དེ་ཡིས་བཅོམ་ལྡན་འདས་ལ་ནི། །མཆོད་པ་བྱས་ཞེས་བརྗོད་མི་བྱ། །མིག་ཟད་མཐའ་ཡི་ངོ་བོ་ཉིད།
en: In terms of marks cannot be said to worship the Blessed One,

source: །རྟོགས་པར་ཡང་ནི་མི་འགྱུར་རོ། །མཚན་མ་རྣམས་ནི་གང་སྤངས་པ། །ཡོན་ཏན་བཞི་ནི་བསགས་པས་ན།
en: And they do not realize

source: །མིག་ཟད་མཐའ་ཡི་ངོ་བོ་ཉིད།
en: The nature of the limit of the exhaustion of the eye. “Those who abandon marks gather the basis of all qualities,

source: །རབ་ཏུ་རྟོགས་པར་ཡང་འགྱུར་རོ། །འདི་ལྟར་མིག་ནི་ཟད་པའི་མཐའ།
en: And so they realize the nature of the limit of the exhaustion of the eye.

source: །རབ་ཏུ་རྟོགས་པར་གྱུར་པའི་ཕྱིར།
en: Since they will realize the limit of the exhaustion of the eye,

source: །སངས་རྒྱས་རྣམས་ཀྱི་ཡོན་ཏན་ཡང་། །རབ་ཏུ་རྟོགས་པར་ཁོང་དུ་ཆུད། །མིག་ནི་ཟད་པའི་མཐའ་དག་ལ།
en: They will also comprehend the buddhas’ qualities.

source: །མི་འཛིན་སྦེད་པ་མེད་པ་དང་། །མིག་ནི་སྐྱེ་བའི་མཐའ་དག་ལ།
en: “With no grasping and obscuration regarding the limit of the exhaustion of the eye,

source: །རྟེན་ཅིང་གནས་པ་མེད་པ་དང་། །མིག་ནི་རབ་ཏུ་དབེན་པ་ལ།
en: With no maintaining and dwelling on the limit of the arising of the eye,

source: །གཡོ་བའི་བསམ་པ་མེད་གྱུར་པ།
en: And free of thinking regarding the disengagement of the eye,

source: །དེས་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས། །མཐོང་བ་ཉིད་དུ་གྱུར་པ་ཡིན།
en: One truly sees the thus-gone ones.

source: །མིག་ནི་སྐྱེ་བའི་མཐའ་དག་ལ།
en: “Those who are free of thoughts regarding the limit of the arising of the eye,

source: །རྣམ་པར་རྟོག་པ་མེད་པ་དང་། །མིག་གི་མཐའ་ནི་གང་ཡིན་པ།
en: Who are free of mental concepts regarding the limit of the eye,

source: །དེ་ལ་ཡིད་ཀྱི་རྟོག་མེད་དང་། །མིག་ནི་རྣམ་པར་འཇིག་པ་ལ། །བསྟན་པར་བྱ་བ་མེད་གྱུར་པ།
en: And who do not express anything regarding the eye’s disintegration

source: །མིག་ནི་མེད་པར་གྱུར་པ་ལ།
en: “Those who are free of attachment regarding the nonexistence of the eye,

source: །མངོན་པར་ཞེན་པ་མེད་པ་དང་། །མིག་ནི་སྐྱེ་བ་མེད་པ་ལ།
en: Free of grasping regarding the eye’s unborn nature,

source: །ཡོངས་སུ་སྡུད་པ་མེད་པ་དང་། །མིག་ནི་རབ་ཏུ་ཞི་བ་ལ། །འཛིན་པ་དག་ནི་མེད་གྱུར་པ།
en: And free of clinging regarding the eye’s utter peace

source: །མིག་ནི་ཟད་པར་ཤེས་པའི་ཕྱིར།
en: “Since they understand the eye’s exhaustion, they actualize the marks.

source: །མཚན་རྣམས་མངོན་པར་བསྒྲུབ་པ་དང་། །མིག་གི་མཐའ་ནི་ཤེས་པའི་ཕྱིར།
en: Since they understand the limit of the eye, they ascertain the faculties.

source: །དབང་པོ་དག་ནི་ངེས་གྱུར་དང་། །མིག་ནི་སྐྱེ་བ་ཤེས་པའི་ཕྱིར། །དབང་པོ་རང་དབང་ཐོབ་གྱུར་པ།
en: Since they understand the eye’s arising, they reach mastery over their faculties.

source: །མིག་ནི་མེད་པར་རྟོགས་གྱུར་ནས།
en: “Having realized the nonexistence of the eye, they comprehend forms.

source: །གཟུགས་ནི་ཁོང་དུ་ཆུད་པ་དང་། །མིག་ནི་འཇིག་པར་རབ་ཤེས་ནས།
en: Having realized the eye’s disintegration, they discern phenomena.

source: །ཆོས་ལ་སོ་སོར་རྟོག་པ་དང་། །མིག་ནི་སྐྱེ་མེད་ཤེས་གྱུར་ནས། །ལམ་ནི་སྒྲུབ་པར་གང་བྱེད་པ།
en: Having realized the eye’s unborn nature, they accomplish the path.

source: །མིག་ཟད་མཐའ་ནི་གང་ཡིན་པ།
en: “Since they genuinely realize the limit of the exhaustion of the eye,

source: །ཡང་དག་ཇི་བཞིན་རྟོགས་པའི་ཕྱིར། །ལས་ཀྱི་བྱེ་བྲག་ཐ་དད་པ། །དེ་ཡང་རབ་ཏུ་རྟོགས་པར་འགྱུར།
en: They also understand the different types of actions,

source: །ལས་ཀྱི་བྱེ་བྲག་ཐ་དད་པ། །རབ་ཏུ་རྟོགས་པར་གྱུར་པའི་ཕྱིར།
en: And since they understand the different types of actions,

source: །མིག་སྐྱེ་མཐའ་ནི་གང་ཡིན་པ།
en: “Since they genuinely realize the limit of the arising of the eye,

source: །ཡང་དག་ཇི་བཞིན་རྟོགས་པའི་ཕྱིར། །སྡུག་བསྔལ་བྱེ་བྲག་ཐ་དད་པ། །དེ་ཡང་རབ་ཏུ་རྟོགས་པར་འགྱུར།
en: They also understand the different types of suffering,

source: །སྡུག་བསྔལ་བྱེ་བྲག་ཐ་དད་པ། །རབ་ཏུ་རྟོགས་པར་གྱུར་པའི་ཕྱིར།
en: And since they understand the different types of suffering,

source: །དེས་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས། །མཐོང་བ་ཉིད་དུ་གྱུར་པ་ཡིན། །མིག་གི་འཇིག་པ་གང་ཡིན་པ།
en: They truly see the thus-gone ones.

source: །ཡང་དག་ཇི་བཞིན་རྟོགས་པའི་ཕྱིར། །སྡུག་བསྔལ་འཇིག་པ་གང་ཡིན་པ།
en: “Since they genuinely realize the eye’s disintegration,

source: །དེ་ཡང་རབ་ཏུ་རྟོགས་པར་འགྱུར། །སྡུག་བསྔལ་འཇིག་པ་གང་ཡིན་པ།
en: They also realize the disintegration of suffering,

source: །མིག་གི་མེད་པ་གང་ཡིན་པ། །ཡང་དག་ཇི་བཞིན་རྟོགས་པའི་ཕྱིར། །མཚན་མ་སྤངས་པ་གང་ཡིན་པ།
en: “Since they genuinely realize the nonexistence of the eye,

source: །དེ་ཡང་རབ་ཏུ་རྟོགས་པར་འགྱུར། །མཚན་མ་སྤངས་པ་གང་ཡིན་པ།
en: They also realize the abandonment of characteristics,

source: །མིག་གི་སྐྱེ་མེད་གང་ཡིན་པ། །ཡང་དག་ཇི་བཞིན་རྟོགས་པའི་ཕྱིར། །བག་ཆགས་སྤངས་པ་གང་ཡིན་པ།
en: “Since they genuinely realize the unborn nature of the eye,

source: །དེ་ཡང་རབ་ཏུ་རྟོགས་པར་འགྱུར། །བག་ཆགས་སྤངས་པ་གང་ཡིན་པ།
en: They also realize the abandonment of latent patterns,

source: དེས་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས། །མཐོང་བ་ཉིད་དུ་གྱུར་པ་ཡིན།
en: They truly see the thus-gone ones.

source: །གཞན་ཡང་མིག་གི་མི་རྟོག་ཉིད། །ཡང་དག་ཇི་བཞིན་རྟོགས་པའི་ཕྱིར། །སྒྲིབ་པ་སྤངས་པ་གང་ཡིན་པ།
en: “Furthermore, since they genuinely realize the nonconceptual nature of the eye,

source: །དེ་ཡང་རབ་ཏུ་རྟོགས་པར་འགྱུར། །སྒྲིབ་པ་སྤངས་པ་གང་ཡིན་པ།
en: They also realize the abandonment of obscurations,

source: །གཞན་ཡང་མིག་ལ་ཡི་གེ་མེད། །ཡང་དག་ཇི་བཞིན་རྟོགས་པའི་ཕྱིར།
en: “Furthermore, since they genuinely realize that the eye is beyond words,

source: །སངས་རྒྱས་ཡེ་ཤེས་སྟོབས་དག་ཀྱང་། །རབ་ཏུ་རྟོགས་པར་གྱུར་པ་ཡིན།
en: They also realize the strength of awakened wisdom,

source: །སངས་རྒྱས་ཡེ་ཤེས་སྟོབས་དག་ནི། །རབ་ཏུ་རྟོགས་པར་གྱུར་པའི་ཕྱིར།
en: And since they realize the strength of awakened wisdom,

source: །གཞན་ཡང་མིག་གི་མི་འོང་ཉིད། །ཡང་དག་ཇི་བཞིན་རྟོགས་པའི་ཕྱིར།
en: “Furthermore, since they genuinely realize that the eye does not come from anywhere,

source: །འདོད་རྣམས་སྤངས་པ་གང་ཡིན་པ། །དེ་ཡང་རབ་ཏུ་རྟོགས་པར་འགྱུར།
en: They also realize the abandonment of desires,

source: །འདོད་རྣམས་སྤངས་པ་གང་ཡིན་པ། །རབ་ཏུ་རྟོགས་པར་གྱུར་པའི་ཕྱིར།
en: And since they realize the abandonment of desires,

source: །གཞན་ཡང་བསམ་གཏན་བསྒོམ་པ་དག །ཡང་དག་ཇི་བཞིན་རྟོགས་པའི་ཕྱིར། །ཉོན་མོངས་སྤངས་པ་གང་ཡིན་པ།
en: “Furthermore, since they genuinely realize the practice of concentration,

source: །དེ་ཡང་རབ་ཏུ་རྟོགས་པར་འགྱུར། །ཉོན་མོངས་སྤངས་པ་གང་ཡིན་པ།
en: They also realize the abandonment of afflictions,

source: །གང་ཟག་དེས་ནི་དེ་བཞིན་དུ།
en: “Similarly, those persons also perfect The knowledge of the eye’s past limit, The knowledge of the eye’s lack of abiding, The knowledge of the eye’s arising, “The knowledge of the Buddha’s miraculous powers, The knowledge of the eye’s inferior character, The knowledge of the eye’s exalted character, The knowledge of lower wisdom, “The knowledge of pure wisdom, The knowledge of pure discipline, The knowledge of the physical precepts, The knowledge of pure sound, “The knowledge of the verbal precepts, The knowledge of pure mind, The knowledge of the particular places of abiding, The knowledge of mental phenomena, “The knowledge of mental defects, The knowledge of pure actions, The knowledge of the mental precepts, The knowledge of intellectual shortcomings, “The knowledge of pure sound,

source: །མིག་གི་སྔོན་མཐའ་ཤེས་པ་དང་། །མིག་གི་མི་གནས་ཤེས་པ་དང་། །མིག་གི་སྐྱེ་བ་ཤེས་པ་དང་། །སངས་རྒྱས་རྫུ་འཕྲུལ་ཤེས་པ་དང་། །མིག་གི་དམན་པ་ཤེས་པ་དང་། །མིག་གི་ཁྱད་པར་འཕགས་ཤེས་དང་། །ཡེ་ཤེས་དམན་པ་ཤེས་པ་དང་། །རྣམ་དག་ཡེ་ཤེས་ཤེས་པ་དང་། །ཚུལ་ཁྲིམས་རྣམ་དག་ཤེས་པ་དང་། །ལུས་ཀྱི་སྡོམ་པའི་ཤེས་པ་དང་། །རྣམ་དག་སྒྲ་ཡི་ཤེས་པ་དང་། །ངག་གི་སྡོམ་པའི་ཤེས་པ་དང་། །རྣམ་དག་སེམས་ཀྱི་ཤེས་པ་དང་། །གནས་ཀྱི་བྱེ་བྲག་ཤེས་པ་དང་། །སེམས་ཀྱི་ཆོས་ཀྱི་ཤེས་པ་དང་། །སེམས་སྐྱོན་ཤེས་པའི་ཤེས་པ་དང་། །རྣམ་དག་ལས་ཀྱི་ཤེས་པ་དང་། །སེམས་ཀྱི་སྡོམ་པའི་ཤེས་པ་དང་། །ཉེས་དམིགས་ཤེས་པའི་ཤེས་པ་དང་། །རྣམ་དག་སྒྲ་ཡི་ཤེས་པ་དང་། །ཕུང་པོའི་བྱེ་བྲག་ཤེས་པ་དང་། །ཕུང་པོའི་རྒྱུ་རྐྱེན་ཤེས་པ་དང་། །མིག་ནི་ཡོངས་ཤེས་ཤེས་པ་དང་། །སྡུག་བསྔལ་འབྱུང་གནས་ཤེས་པ་དང་། །ཟག་མེད་ཚུལ་ཁྲིམས་ཤེས་པ་དང་། །ཚུལ་ཁྲིམས་རྒྱུ་རྐྱེན་ཤེས་པ་དང་། །སྡུག་བསྔལ་རྒྱུ་རྐྱེན་ཤེས་པ་དང་། །སྡུག་བསྔལ་ཟད་པའི་རྒྱུ་ཤེས་དང་། །འདུས་བྱས་རྣམས་ཀྱི་ཤེས་པ་དང་། །ཟག་པ་ཟད་པའི་ཤེས་པ་དག །ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ཡིན།
en: The knowledge of the various aggregates, The knowledge of the causes and conditions of the aggregates, The knowledge of the total knowing of the eye, “The knowledge of the source of suffering, The knowledge of undefiled discipline, The knowledge of the causes and conditions of discipline, The knowledge of the causes and conditions of suffering, “The knowledge of the causes of suffering’s exhaustion, The knowledge of conditioned phenomena, And the knowledge of the exhaustion of defilements — They perfect all these knowledges.

source: །གཞན་ཡང་རྒྱུ་རྐྱེན་བཅུ་གཉིས་ཀྱི།
en: “Furthermore, they genuinely achieve Knowledge of the twelve causes and conditions—

source: །སྤྱོད་དང་བཅས་པའི་ཤེས་པ་དང་། །སྤྱོད་པ་མེད་པའི་ཤེས་པ་དང་། །མཚན་མ་བཅས་དང་མཚན་མ་མེད།
en: Both the knowledge that involves engagement And the knowledge that does not involve engagement— “And, likewise, knowledge of marks and the absence of marks,

source: །འདུས་བྱས་དང་ནི་འདུས་མ་བྱས།
en: Knowledge of the conditioned and the unconditioned,

source: །རྣམ་པར་གཞག་དང་ཡོངས་སྡུད་དང་། །བདག་དང་གཞན་གྱི་སེམས་ཤེས་པ།
en: Knowledge of classifications and summaries, And knowledge of the minds of oneself and others.

source: །ཡང་དག་ཇི་བཞིན་ཤེས་པ་ཡིན།
en: “Furthermore, since they genuinely realize

source: །གཞན་ཡང་མིག་ཟད་སྐྱེ་མཐའ་དང་། །མིག་གི་མཐའ་དང་རབ་དབེན་དང་། །འཇུག་པ་དང་ནི་མེད་པ་དང་། །མི་སྐྱེ་བ་དང་ཉེར་ཞི་ཉིད། །ཡང་དག་ཇི་བཞིན་ཤེས་པས་ན།
en: The limit of the exhaustion of the eye, the limit of its arising, Its limit, its disengagement, its cognition, its nonexistence, Its unborn nature, and its peace,

source: །རྣམ་པར་དག་པའི་ཡེ་ཤེས་དང་། །མཐུ་དང་བཅས་པའི་ཡེ་ཤེས་དང་། །བརྩོན་འགྲུས་ཡེ་ཤེས་འཐོབ་པར་བྱེད།
en: To achieve pure wisdom, Powerful wisdom, And diligent wisdom. “Furthermore, they genuinely achieve

source: །གཞན་ཡང་གཅིག་དང་ཐ་དད་ཤེས།
en: The knowledge of sameness and difference, And the knowledge of the inclinations

source: །སེམས་ཅན་དག་ནི་ཐམས་ཅད་ཀྱི།
en: Of all sentient beings. “They also genuinely achieve

source: །མོས་པའི་ཤེས་པ་གང་ཡིན་པ། །ཡང་དག་ཇི་བཞིན་ཤེས་པ་ཡིན།
en: The knowledge of the superior inclinations

source: །གཞན་ཡང་སེམས་ཅན་ཐམས་ཅད་ཀྱི།
en: Of all sentient beings, as well as The knowledge of the purity of their minds,

source: །མོས་པ་ཁྱད་པར་འཕགས་པ་དང་། །རྣམ་དག་སེམས་ཀྱི་ཤེས་པ་དང་། །ལས་དང་རྣམ་སྨིན་ཤེས་པ་དང་། །དབང་པོ་ཁམས་ཀྱི་ཤེས་པ་དང་། །སེམས་ཀྱི་འགྱུར་བ་ཤེས་པ་དང་། །ཤེས་རབ་མོས་པའི་ཤེས་པ་དང་། །ཤིན་ཏུ་རྣམ་གྲོལ་ཤེས་པ་དང་། །སྤོབས་པ་མཆོག་གི་ཤེས་པ་དག །ཡང་དག་ཇི་བཞིན་ཤེས་པ་ཡིན།
en: “The knowledge of actions and karmic ripening, The knowledge of the sense faculties and the elements, The knowledge of mental transformations, the knowledge of insight and dedication, The knowledge of complete liberation, and the knowledge of supreme eloquence. “Furthermore, since they genuinely understand

source: །གཞན་ཡང་སེམས་ཅན་མ་རུངས་དང་། །ཆོས་ལ་མོས་པ་མེད་གྱུར་པ། །ཡང་དག་ཇི་བཞིན་ཤེས་པས་ན།
en: Those sentient beings who are malicious And show no interest in the Dharma,

source: །མོས་པའི་ཤེས་པ་སྐྱེད་པར་བྱེད།
en: They are able to inspire them.

source: །གཞན་ཡང་དོན་གྱི་ཚུལ་དག་ནི།
en: “Since they genuinely realize

source: །ཡང་དག་ཇི་བཞིན་ཤེས་པས་ན།
en: The ways things are,

source: །ལེ་ལོ་མེད་པའི་ཤེས་པ་དག །དུས་ཤེས་སྒྲུབ་པར་བྱེད་པ་ཡིན།
en: They also achieve the knowledge devoid of laziness As well as the knowledge of time.

source: །གཞན་ཡང་རྫུ་འཕྲུལ་སྟོབས་དག་གིས།
en: “Through their miraculous powers, They also genuinely realize

source: །ཆོས་རྣམས་རབ་ཏུ་འབྱེད་པ་དང་། །ཐོགས་པ་མེད་པའི་ཡེ་ཤེས་དག །ཡང་དག་ཇི་བཞིན་ཤེས་པ་ཡིན།
en: The knowledge that discriminates phenomena From the unimpeded wisdom. “They also genuinely achieve

source: །གཞན་ཡང་རྒྱ་ཆེན་དོན་དག་དང་། །ཚིག་གིས་བསྟན་པ་གང་ཡིན་པ།
en: The knowledge of the vast meaning,

source: །རྗེས་སུ་ཤེས་པའི་ཤེས་པ་དག །ཡང་དག་ཇི་བཞིན་ཤེས་པ་ཡིན།
en: And knowledge associated With verbal teachings. “They also genuinely achieve

source: །གཞན་ཡང་གྲོགས་བཟང་འཐུན་གནས་དང་། །གོས་དང་ཟས་དང་བཏུང་བ་དག །ཚོད་ཤེས་པ་ཡི་ཤེས་པ་རྣམས།
en: The knowledge concerning good companions and conducive places, As well as the knowledge concerning moderation Related to clothing, food, and beverages. “They also genuinely achieve

source: །གཞན་ཡང་བྱ་བ་མེད་པ་ཡི། །གཟུགས་ཀྱི་ཆོས་ནི་གང་ཡིན་པ། །ནན་ཏན་བསྒྲུབ་པའི་ཤེས་པ་དག །ཡང་དག་ཇི་བཞིན་ཤེས་པ་ཡིན།
en: Related to nonaction.

source: །གཞན་ཡང་ལུས་སེམས་སྐྱོན་མེད་ཅིང་།
en: “Likewise, devoid of physical and mental faults,

source: །སྒྲོ་འདོགས་སྐུར་འདེབས་ཡོངས་སྤངས་ནས།
en: And having abandoned exaggeration and denigration, They also genuinely achieve

source: །བླ་མེད་ཡེ་ཤེས་གང་ཚོལ་བ། །ཡང་དག་ཇི་བཞིན་ཤེས་པ་ཡིན།
en: The unsurpassed wisdom they pursue.

source: །ནམ་མཁའ་བར་སྣང་དག་ལས་ནི། །སྤྲུལ་པའི་སྐུ་ནི་རབ་བསྟན་ནས།
en: They manifest emanated bodies in the sky.

source: །སེམས་ཅན་དག་ནི་བརྒྱ་སྟོང་སྙེད། །ཡོངས་སུ་སྨིན་པར་མཛད་པས་ན།
en: They thereby ripen hundreds of thousands of beings,

source: །ཐམས་ཅད་རབ་ཏུ་དགའ་གྱུར་ནས།
en: Bringing everyone great joy with their knowledge of engendering faith.
